Revit 2027 API
GroupTypeId.SegmentsFittings Property
 Segments and Fittings.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId SegmentsFittings { get; }
Public Shared ReadOnly Property SegmentsFittings As ForgeTypeId
	Get
public:
static property ForgeTypeId^ SegmentsFittings {
	ForgeTypeId^ get ();
}
static member SegmentsFittings : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
GroupTypeId Class
Autodesk.Revit.DB Namespace